# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает,
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов
# (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова,
# если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”,
# если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример: *

# **Ввод: ** пара-ра-рам рам-пам-папам па-ра-па-да
# **Вывод: ** Парам пам-пам


def check_rhythm(poem):
    phrases = poem.split()  # Разделение стихотворения на фразы
    syllable_counts = []  # Список для хранения количества слогов в каждой фразе

    for phrase in phrases:
        words = phrase.split('-')  # Разделение фразы на слова
        # Подсчет количества слогов в каждом слове
        syllables = sum(word.count('a') for word in words)
        syllable_counts.append(syllables)

    if len(set(syllable_counts)) == 1:
        return "Парам пам-пам"
    else:
        return "Пам парам"


# Пример использования:
poem = input("Введите стихотворение: ")
result = check_rhythm(poem)
print(result)
